---
kind: property
id: P:Autodesk.Revit.DB.LinearArray.NumMembers
source: html/f2ed4299-f623-dc05-6e95-f3bfd234d9ae.htm
---
# Autodesk.Revit.DB.LinearArray.NumMembers Property

Retrieves or changes the number of the arrayed members.

## Syntax (C#)
```csharp
public override int NumMembers { get; set; }
```